/***
 *                                                                                    
 *     @@@@@@@ @@@  @@@  @@@@@@ @@@ @@@@@@@@ @@@@@@@     @@@@@@@@ @@@@@@  @@@@@@@     
 *    !@@      @@!  @@@ !@@     @@! @@!      @@!  @@@    @@!     @@!  @@@ @@!  @@@    
 *    !@!      @!@!@!@!  !@@!!  !!@ @!!!:!   @!@!!@!     @!!!:!  @!@  !@! @!@!!@!     
 *    :!!      !!:  !!!     !:! !!: !!:      !!: :!!     !!:     !!:  !!! !!: :!!     
 *     :: :: :  :   : : ::.: :  :   : :: ::   :   : :     :       : :. :   :   : :    
 *                                                                                    
 *                                                                                    
 *     @@@@@@  @@@@@@  @@@          @@@@@@@  @@@@@@@  @@@ @@@  @@@ @@@@@@@@ @@@@@@@   
 *    !@@     @@!  @@@ @@!          @@!  @@@ @@!  @@@ @@! @@!  @@@ @@!      @@!  @@@  
 *     !@@!!  @!@  !@! @!! @!@!@!@! @!@  !@! @!@!!@!  !!@ @!@  !@! @!!!:!   @!@!!@!   
 *        !:! !!:  !!! !!:          !!:  !!! !!: :!!  !!:  !: .:!  !!:      !!: :!!   
 *    ::.: :   : :. :  : ::.: :     :: :  :   :   : : :      ::    : :: ::   :   : :  
 *
 * @Author: Chsier
 * @Date: 2022-04-23 12:38:08
 * @LastEditTime: 2022-04-24 21:08:15
 * @LastEditors: Chsier
 * @Description: 
 * @Version: v_
 * @E-mail: Chsier225@gmail.com
 * @FilePath: \Comp_Application\Library\sol_driver\bsp\src\bsp_buffer.c
 * @版权声明:如果您继续浏览、使用本代码，将默认您遵守以下声明：
 *         1.不会将此代码以及此代码的衍生代码用作商业用途 
 *         2.在转载和发布此代码和此代码的衍生代码时会注明原出处
 */

/*-------------------------------------------------------*\
						 Include
\*-------------------------------------------------------*/
#include "bsp_buffer.h"

#ifdef USER_FUN
#endif
/*-------------------------------------------------------*\
						 Define
\*-------------------------------------------------------*/

#ifdef USER_FUN
#endif
/*-------------------------------------------------------*\
					  Global Ver
\*-------------------------------------------------------*/
//接收完成标志
bool_t uart_rx_cmp_flag_0 = 0;
bool_t uart_rx_cmp_flag_1 = 0;
bool_t uart_rx_cmp_flag_2 = 0;
bool_t uart_rx_cmp_flag_3 = 0;
//串口缓冲区
uint8_t uart_buf_0 [UART_BUF_SIZE] = {0};
uint8_t uart_buf_1 [UART_BUF_SIZE] = {0};
uint8_t uart_buf_2 [UART_BUF_SIZE] = {0};
uint8_t uart_buf_3 [UART_BUF_SIZE] = {0};
//串口缓冲区指针
uint8_t * uart_buf_0_p = uart_buf_0;
uint8_t * uart_buf_1_p = uart_buf_1;
uint8_t * uart_buf_2_p = uart_buf_2;
uint8_t * uart_buf_3_p = uart_buf_3;
//串口缓冲区溢出计数
uint16_t uart_buf_0_cnt = 0;
uint16_t uart_buf_1_cnt = 0;
uint16_t uart_buf_2_cnt = 0;
uint16_t uart_buf_3_cnt = 0;
//规定每次串口收发的字节数变量
uint16_t uart_byte_limit = 0;

/*-------------------------------------------------------*\
					  Static PV
\*-------------------------------------------------------*/

/*-------------------------------------------------------*\
				Static fun declaration
\*-------------------------------------------------------*/

/*-------------------------------------------------------*\
				Static function body
\*-------------------------------------------------------*/

/*-------------------------------------------------------*\
			Related referential function body
\*-------------------------------------------------------*/
